CasaPizza/app/controllers/main_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ? LIMIT ?  [["category_id", 1], ["LIMIT", 1]]
---
	def index
		current_user = User.find_by_id(session[:current_user_id])
		@recomended=Product.find_by(category_id: rand(1..5))