CasaPizza/app/controllers/user_controller.rb

INSERT INTO "users" ("nick", "passwd", "name", "srname", "phone", "adress", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
	def show
		@user=User.find(session[:current_user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
	def edit
		@user=User.find(session[:current_user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "test@gmail.com"], ["updated_at", "2021-01-17 11:06:48.940321"], ["id", 8]]
---
	def update
		@user=User.find(session[:current_user_id])
		if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."nick" = ? LIMIT ?  [["nick", "pabs"], ["LIMIT", 1]]
---
	def signIn
		@user = User.find_by(nick: params[:nick])